УТ_для_edt/src/InformationRegisters/CRM_НастройкиРасположенияЭлементовНаФормах/CRM_НастройкиРасположенияЭлементовНаФормах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НастройкиРасположенияЭлементовНаФормах</name>
  <resources>
    <name>ЗаголовокЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяЭлементаРазмещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокРасположения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяЭлемента</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛицаПартнеров</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>ДатаРегистрацииСвязи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Ключевой</name>
    <comment>Ключевой контакт</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЛичныеИнтересы</name>
    <comment>Личные интересы контактного лица</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НапоминатьОДнеРождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольКонтактногоЛица</name>
    <type>
      <types>CatalogRef.РолиКонтактныхЛицПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЭлектроннаяПочтаНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЛогинНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Состояние</name>
    <type>
      <types>EnumRef.CRM_Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СтатусыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеровПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Должность</name>
    <type>
      <types>CatalogRef.CRM_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрекращенияСвязи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПоВизитке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпCoMagicID</name>
    <comment>Идентификатор контакта в системе CoMagic</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпПользовательДляПереключенияЗвонков</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Взаимодействия</name>
    <comment>Взаимодействия</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_ВладелецБизнеса</name>
    <comment>Владелец бизнеса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Заказчик</name>
    <comment>Заказчик</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Противник</name>
    <comment>Противник</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Прочее</name>
    <comment>Прочее</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Спонсор</name>
    <comment>Спонсор</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Сторонник</name>
    <comment>Сторонник</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_ТипОтношенийПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартТелефонНаСайте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартИдентификаторБитрикс</name>
    <comment>//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка &quot;Личный кабинет&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартАктивностьНаСайте</name>
    <comment>//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка &quot;Личный кабинет&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиКонтактногоЛица</name>
    <attributes>
      <name>РольКонтактногоЛица</name>
      <type>
        <types>CatalogRef.РолиКонтактныхЛицПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_КлючевыеСобытия</name>
    <comment>Ключевые события контакта</comment>
    <attributes>
      <name>ВидСобытия</name>
      <comment>Вид ключевого события</comment>
      <type>
        <types>CatalogRef.CRM_ВидыКлючевыхСобытий</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСобытия</name>
      <comment>Дата ключевого события</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НапоминатьОСобытии</name>
      <comment>Напоминать о ключевом событии</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Статусы</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.CRM_СтатусыКонтактныхЛиц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_УправлениеЭлементамиНаФормах/Module.bsl
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для стандартной обработки дополнительных реквизитов.

// Создает основные реквизиты и поля формы, необходимые для работы.
// Заполняет дополнительные реквизиты, если используются.
// Вызывается из обработчика ПриСозданииНаСервере формы объекта со свойствами.
// 
// Параметры:
//  Форма							- ФормаКлиентскогоПриложения - в которой будут отображаться дополнительные реквизиты.
//  ИмяЭлементаРазмещенияКоманды	- Строка - имя элемента размещения команды.
//  ДопИмяЭлементаРазмещенияКоманды - Строка - дополнительное имя элемента размещения команды.
//  ПостфиксФормы					- Строка - постфикс формы.
//
Процедура ПриСозданииНаСервере(Форма, ИмяЭлементаРазмещенияКоманды = "", ДопИмяЭлементаРазмещенияКоманды = "", ПостфиксФормы = "") Экспорт
	
	Если Форма.Параметры.Свойство("РасположениеЭлементовПоУмолчанию") Тогда
		Возврат;
	КонецЕсли;
	ОписаниеФормы = Неопределено;
	Если ОписаниеНастраиваемыхФорм().Свойство(СтрЗаменить(Форма.ИмяФормы, ".", "_"), ОписаниеФормы) Тогда
		
		РазместитьЭлементыПоНастройке(Форма, ОписаниеФормы, ПостфиксФормы);
		
		ДоступноРедактированиеРасположенияЭлементовФормы = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("CRM_НастройкаПрограммы");
		Если ДоступноРедактированиеРасположенияЭлементовФормы Тогда
			
			Если ЗначениеЗаполнено(ИмяЭлементаРазмещенияКоманды) Тогда
				ЭлементРазмещенияКоманды = Форма.Элементы.Найти(ИмяЭлементаРазмещенияКоманды);
				Если ЭлементРазмещенияКоманды = Неопределено Тогда
					Возврат;
				КонецЕсли;	
			Иначе 
				ЭлементРазмещенияКоманды = Форма.Элементы.Найти("КоманднаяПанельФормы");
				Если ЭлементРазмещенияКоманды = Неопределено Тогда
					Возврат;
				КонецЕсли;	
			КонецЕсли;
			
			Если Форма.Команды.Найти("НастроитьРасположениеЭлементовФормы") = Неопределено Тогда
				Команда = Форма.Команды.Добавить("НастроитьРасположениеЭлементовФормы");
				Команда.Действие = "Подключаемый_НастройкаРасположенияЭлементовФормы";
				
				КнопкаНастройки = Форма.Элементы.Добавить("НастроитьРасположениеЭлементовФормы", Тип("КнопкаФормы"), ЭлементРазмещенияКоманды);
				КнопкаНастройки.Заголовок = НСтр("ru='Настроить состав и расположение полей';en='Set Up Composition and Field Location'");
				КнопкаНастройки.Картинка = БиблиотекаКартинок.CRM_НастройкиРабочийСтол;
				КнопкаНастройки.ИмяКоманды = "НастроитьРасположениеЭлементовФормы";
				КнопкаНастройки.ТолькоВоВсехДействиях = Истина;
				
				Если ЗначениеЗаполнено(ДопИмяЭлементаРазмещенияКоманды) Тогда
					ЭлементРазмещенияКоманды = Форма.Элементы.Найти(ДопИмяЭлементаРазмещенияКоманды);
					Если ЭлементРазмещенияКоманды <> Неопределено Тогда
						КнопкаНастройки = Форма.Элементы.Добавить("ДопНастроитьРасположениеЭлементовФормы", Тип("КнопкаФормы"), ЭлементРазмещенияКоманды);
						КнопкаНастройки.Заголовок = НСтр("ru='Настроить поля';en='Configure Fields'");
						КнопкаНастройки.ИмяКоманды = "НастроитьРасположениеЭлементовФормы";
						КнопкаНастройки.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
						КнопкаНастройки.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
				
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание настраиваемых форм.
//
// Параметры:
//	ЭтоПоддержка - Булево - признак поддержки.
//
// Возвращаемое значение:
//	Структура - описания форм.
Функция ОписаниеНастраиваемыхФорм(ЭтоПоддержка = Ложь) Экспорт
	
	ОписанияФорм = Новый Структура;	
	
	// Новая форма интереса
	#Область НоваяФормаИнтереса
	
	ОписаниеФормы = Новый Структура;
	
	МассивОбластей = Новый Массив;
	МассивОбластей.Добавить("ГруппаОсновное");
	МассивОбластей.Добавить("ГруппаДополнительно");
	ОписаниеФормы.Вставить("МассивОбластей", МассивОбластей);
	
	МассивИсключаемыхЭлементов = Новый Массив;
	МассивИсключаемыхЭлементов.Добавить("Ссылка");
	МассивИсключаемыхЭлементов.Добавить("ДекорацияАвторДата");
	МассивИсключаемыхЭлементов.Добавить("ГруппаДополнительныеРеквизиты");
	
	Если НЕ ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
		МассивИсключаемыхЭлементов.Добавить("ГруппаОбщиеСведенияИсточникСостояние");
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("CRM_ИспользоватьТипыУслуг") Тогда
		МассивИсключаемыхЭлементов.Добавить("ТипУслуги");
	КонецЕсли;
	
	МассивИсключаемыхЭлементов.Добавить("ГруппаОбращение");
	Если ЭтоПоддержка Тогда
		МассивИсключаемыхЭлементов.Добавить("ГруппаВыручка");
	КонецЕсли;
	
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ИмяФО = "ИспользоватьСделкиСКлиентами";
		Если НЕ ПолучитьФункциональнуюОпцию(ИмяФО) Тогда
			МассивИсключаемыхЭлементов.Добавить("СделкаСКлиентом");
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеФормы.Вставить("МассивИсключаемыхЭлементов", МассивИсключаемыхЭлементов);
	
	СписокНаборовДопРеквизитов = Новый СписокЗначений;
	Выборка = Справочники.НаборыДополнительныхРеквизитовИСведений.Выбрать(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_CRM_Интерес);
	Пока Выборка.Следующий() Цикл
		СписокНаборовДопРеквизитов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	ОписаниеФормы.Вставить("СписокНаборовДопРеквизитов", СписокНаборовДопРеквизитов);
	ОписаниеФормы.Вставить("ИмяЭлементаПередКоторымВставлять", "ГруппаСвязанныеСписки");
	
	ОписанияФорм.Вставить(СтрЗаменить("Документ.CRM_Интерес.Форма.ФормаДокументаНовая", ".", "_"), ОписаниеФормы);	
	
	#КонецОбласти
	
	#Область ПартнерыФормаЭлементаНовая
	
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		
		ОписаниеФормы = Новый Структура;
		
		МассивОбластей = Новый Массив;
		МассивОбластей.Добавить("ГруппаСведения");
		МассивОбластей.Добавить("ГруппаДополнительно");
		ОписаниеФормы.Вставить("МассивОбластей", МассивОбластей);
		
		МассивИсключаемыхЭлементов = Новый Массив;
		МассивИсключаемыхЭлементов.Добавить("Ссылка");
		МассивИсключаемыхЭлементов.Добавить("ДекорацияАвторДата");
		МассивИсключаемыхЭлементов.Добавить("ГруппаДополнительныеРеквизиты");
		
		Если НЕ ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
			МассивИсключаемыхЭлементов.Добавить("ГруппаПервичныйИнтерес");
		КонецЕсли;
		
		ОписаниеФормы.Вставить("МассивИсключаемыхЭлементов", МассивИсключаемыхЭлементов);
		
		СписокНаборовДопРеквизитов = Новый СписокЗначений;
		СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Общие);
		СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Компании_CRM);
		СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_ЧастныеЛица_CRM);
		ОписаниеФормы.Вставить("СписокНаборовДопРеквизитов", СписокНаборовДопРеквизитов);
		ОписаниеФормы.Вставить("ИмяЭлементаПередКоторымВставлять", "ГруппаСвязанныеСписки");
		
		ОписанияФорм.Вставить(СтрЗаменить("Справочник.Партнеры.Форма.CRM_ФормаЭлементаНовая", ".", "_"), ОписаниеФормы);
		
	Иначе
		
		ОписаниеФормы = Новый Структура;
		
		МассивОбластей = Новый Массив;
		МассивОбластей.Добавить("ГруппаСведения");
		МассивОбластей.Добавить("ГруппаДополнительно");
		ОписаниеФормы.Вставить("МассивОбластей", МассивОбластей);
		
		МассивИсключаемыхЭлементов = Новый Массив;
		МассивИсключаемыхЭлементов.Добавить("Ссылка");
		МассивИсключаемыхЭлементов.Добавить("ДекорацияАвторДата");
		МассивИсключаемыхЭлементов.Добавить("ГруппаДополнительныеРеквизиты");
		МассивИсключаемыхЭлементов.Добавить("ГруппаОтношения");
		МассивИсключаемыхЭлементов.Добавить("ГруппаОтношенияДополнительно");
		
		Если НЕ ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") Тогда
			МассивИсключаемыхЭлементов.Добавить("ГруппаПервичныйИнтерес");
		КонецЕсли;
		
		ИмяФО = "ИспользоватьГруппыДоступаПартнеров";
		Если НЕ ПолучитьФункциональнуюОпцию(ИмяФО) Тогда
			МассивИсключаемыхЭлементов.Добавить("ГруппаДоступа");
		КонецЕсли;
		
		ОписаниеФормы.Вставить("МассивИсключаемыхЭлементов", МассивИсключаемыхЭлементов);
		
		СписокНаборовДопРеквизитов = Новый СписокЗначений;
		СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Общие);
		СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Компании_CRM);
		СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_ЧастныеЛица_CRM);
		ОписаниеФормы.Вставить("СписокНаборовДопРеквизитов", СписокНаборовДопРеквизитов);
		ОписаниеФормы.Вставить("ИмяЭлементаПередКоторымВставлять", "ГруппаСвязанныеСписки");
		
		ОписанияФорм.Вставить(СтрЗаменить("Справочник.Партнеры.Форма.CRM_Модуль_ФормаЭлементаРеквизитыКонтрагентаНовая", ".", "_"), ОписаниеФормы);
		
	КонецЕсли;		
	
	#КонецОбласти
	
	#Область КонтактныеЛицаФормаЭлементаНовая

	ОписаниеФормы = Новый Структура;

	МассивОбластей = Новый Массив;
	МассивОбластей.Добавить("ГруппаСведения");
	МассивОбластей.Добавить("ГруппаДополнительно");
	ОписаниеФормы.Вставить("МассивОбластей", МассивОбластей);
	
	МассивИсключаемыхЭлементов = Новый Массив;
	МассивИсключаемыхЭлементов.Добавить("Ссылка");
	МассивИсключаемыхЭлементов.Добавить("ДекорацияАвторДата");
	МассивИсключаемыхЭлементов.Добавить("ГруппаДополнительныеРеквизиты");
	ОписаниеФормы.Вставить("МассивИсключаемыхЭлементов", МассивИсключаемыхЭлементов);
	
	СписокНаборовДопРеквизитов = Новый СписокЗначений;
	СписокНаборовДопРеквизитов.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_КонтактныеЛицаПартнеров);
	ОписаниеФормы.Вставить("СписокНаборовДопРеквизитов", СписокНаборовДопРеквизитов);
	ОписаниеФормы.Вставить("ИмяЭлементаПередКоторымВставлять", "ГруппаСвязанныеСписки");
	
	ОписанияФорм.Вставить(СтрЗаменить("Справочник.КонтактныеЛицаПартнеров.Форма.CRM_ФормаЭлементаНовая", ".", "_"), ОписаниеФормы);	
	
	#КонецОбласти
	
	Для каждого ОписаниеФормы Из ОписанияФорм Цикл
		ОписаниеФормы.Значение.МассивИсключаемыхЭлементов.Добавить("ДопНастроитьРасположениеЭлементовФормы");
	КонецЦикла;
	
	Возврат ОписанияФорм;
	
КонецФункции

// Размещает элементы по настройке.
//
// Параметры:
//  Форма		  - ФормаКлиентскогоПриложения - в которой будут отображаться дополнительные реквизиты.
//	ОписаниеФормы - Структура - описание формы.
//	ПостфиксФормы - Строка - постфикс формы.
//
Процедура РазместитьЭлементыПоНастройке(Форма, ОписаниеФормы = Неопределено, ПостфиксФормы = "") Экспорт
	
	Если ОписаниеФормы = Неопределено Тогда
		ОписаниеНастраиваемыхФорм().Свойство(СтрЗаменить(Форма.ИмяФормы, ".", "_"), ОписаниеФормы);
	КонецЕсли;

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_НастройкиРасположенияЭлементовНаФормах.ИмяЭлемента КАК ИмяЭлемента,
	                      |	CRM_НастройкиРасположенияЭлементовНаФормах.ИмяЭлементаРазмещения КАК ИмяЭлементаРазмещения,
	                      |	CRM_НастройкиРасположенияЭлементовНаФормах.ПорядокРасположения КАК ПорядокРасположения,
	                      |	CRM_НастройкиРасположенияЭлементовНаФормах.ЗаголовокЭлемента КАК ЗаголовокЭлемента
	                      |ИЗ
	                      |	РегистрСведений.CRM_НастройкиРасположенияЭлементовНаФормах КАК CRM_НастройкиРасположенияЭлементовНаФормах
	                      |ГДЕ
	                      |	CRM_НастройкиРасположенияЭлементовНаФормах.ИмяФормы = &ИмяФормы
						  |	И CRM_НастройкиРасположенияЭлементовНаФормах.ИмяЭлемента = CRM_НастройкиРасположенияЭлементовНаФормах.ИмяЭлементаРазмещения
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПорядокРасположения");
	Запрос.УстановитьПараметр("ИмяФормы", Форма.ИмяФормы+?(ПостфиксФормы = "", "", "_")+ПостфиксФормы);
	ВыборкаРазделов = Запрос.Выполнить().Выбрать();
	Если ВыборкаРазделов.Количество()>ОписаниеФормы.МассивОбластей.Количество() Тогда
		ВставлятьРазделыПередИмя = Неопределено;
		ОписаниеФормы.Свойство("ИмяЭлементаПередКоторымВставлять", ВставлятьРазделыПередИмя);
		ВставлятьРазделыПеред = Форма.Элементы.Найти(ВставлятьРазделыПередИмя);
		ГруппаРазделов = Форма.Элементы.Найти("ПользовательскиеРазделыДанных");
		Если ГруппаРазделов = Неопределено Тогда
			Если ВставлятьРазделыПеред = Неопределено Тогда
				ГруппаРазделов = Форма.Элементы.Добавить("ПользовательскиеРазделыДанных", Тип("ГруппаФормы"), );
			Иначе
				ГруппаРазделов = Форма.Элементы.Вставить("ПользовательскиеРазделыДанных", Тип("ГруппаФормы"), ВставлятьРазделыПеред.Родитель, ВставлятьРазделыПеред);
			КонецЕсли;
			ГруппаРазделов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаРазделов.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаРазделов.ОтображатьЗаголовок = Ложь;
			ГруппаРазделов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		КонецЕсли;
		Пока ВыборкаРазделов.Следующий() Цикл
			ЭлементРазмещения = Форма.Элементы.Найти(ВыборкаРазделов.ИмяЭлементаРазмещения);
			Если ЭлементРазмещения = Неопределено Тогда
				ЭлементРазмещения = Форма.Элементы.Добавить(ВыборкаРазделов.ИмяЭлементаРазмещения, Тип("ГруппаФормы"), ГруппаРазделов);
				ЭлементРазмещения.Заголовок = ВыборкаРазделов.ЗаголовокЭлемента;
				ЭлементРазмещения.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				ЭлементРазмещения.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				ЭлементРазмещения.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
				ЭлементРазмещения.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
				ЭлементРазмещения.Отображение = ОтображениеОбычнойГруппы.Нет;
				ЭлементРазмещения.ЦветТекстаЗаголовка = ЦветаСтиля.CRM_ЧерныйЦветТекста;
				//ЭлементРазмещения.ШрифтЗаголовка = Новый Шрифт(,10,);
				ЭлементРазмещения.Скрыть();
				
				Декорация = Форма.Элементы.Добавить("Декорация" + ВыборкаРазделов.ИмяЭлементаРазмещения, Тип("ДекорацияФормы"), ГруппаРазделов);
				Декорация.Вид = ВидДекорацииФормы.Надпись;
				Декорация.Высота = 1;
				Декорация.Шрифт = Новый Шрифт(,1);
				Декорация.ЦветРамки = Новый Цвет(199, 199, 199);
				Декорация.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.ЧертаСверху, 1);
				Декорация.РастягиватьПоГоризонтали = Истина;
				Декорация.РастягиватьПоВертикали = Ложь;
				Декорация.АвтоМаксимальнаяШирина = Ложь;
			Иначе	
				ЭлементРазмещения.Заголовок = ВыборкаРазделов.ЗаголовокЭлемента;
			КонецЕсли;
			Если ОписаниеФормы.МассивОбластей.Найти(ВыборкаРазделов.ИмяЭлементаРазмещения) = Неопределено Тогда
				Если ВыборкаРазделов.ПорядокРасположения >= ГруппаРазделов.ПодчиненныеЭлементы.Количество() Тогда
				Иначе
					ПередЭлементом = ГруппаРазделов.ПодчиненныеЭлементы[ВыборкаРазделов.ПорядокРасположения-1];
					Если ЭлементРазмещения <> ПередЭлементом Тогда
						Форма.Элементы.Переместить(ЭлементРазмещения, ГруппаРазделов, ПередЭлементом);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИмяЭлемента = CRM", "ИмяЭлемента <> CRM");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.ИмяЭлемента) = Тип("Строка") Тогда
			Элемент = Форма.Элементы.Найти(Выборка.ИмяЭлемента);
		Иначе
			Элемент = Неопределено;
			Если Форма.Свойства_ИспользоватьСвойства И Форма.Свойства_ИспользоватьДопРеквизиты Тогда
				ОписаниеДопРеквизитов = Форма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", Выборка.ИмяЭлемента));
				Если ОписаниеДопРеквизитов.Количество() <> 0 Тогда
					Элемент = CRM_УправлениеСвойствами.ЭлементДопРеквизита(Форма, ОписаниеДопРеквизитов[0]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ЭлементРазмещения = Форма.Элементы.Найти(Выборка.ИмяЭлементаРазмещения);
		Если Элемент<>Неопределено И ЭлементРазмещения<>Неопределено 
			И (ТипЗнч(Выборка.ИмяЭлемента) <> Тип("Строка") 
			ИЛИ ОписаниеФормы.МассивОбластей.Найти(Элемент.Родитель.Имя)<>Неопределено
			ИЛИ СтрНайти(Элемент.Родитель.Имя, "ПользовательскийРаздел")) = 1 Тогда
			Если Выборка.ПорядокРасположения >= ЭлементРазмещения.ПодчиненныеЭлементы.Количество() Тогда
				Форма.Элементы.Переместить(Элемент, ЭлементРазмещения);
			Иначе
				ПередЭлементом = ЭлементРазмещения.ПодчиненныеЭлементы[Выборка.ПорядокРасположения-1];
				Если Элемент <> ПередЭлементом Тогда
					Форма.Элементы.Переместить(Элемент, ЭлементРазмещения, ПередЭлементом);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаРазделов.Сбросить();
	Пока ВыборкаРазделов.Следующий() Цикл
		ЭлементРазмещения = Форма.Элементы.Найти(ВыборкаРазделов.ИмяЭлементаРазмещения);
		Декорация = Форма.Элементы.Найти("Декорация" + ВыборкаРазделов.ИмяЭлементаРазмещения);
		Если Декорация<>Неопределено Тогда
			Декорация.Видимость = (ЭлементРазмещения.ПодчиненныеЭлементы.Количество() > 0);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
